---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices
source: html/c070a383-6732-a4fe-27f2-b28cc5bb89bf.htm
---
# ExternalServices.BuiltInExternalServices Properties

Autodesk Internal: The service for Infrastructure Alignments